/*
    实战题目 / 课后作业:
    有效的字母异位词（亚马逊、Facebook、谷歌在半年内面试中考过）
    字母异位词分组（亚马逊在半年内面试中常考）
    两数之和（亚马逊、字节跳动、谷歌、Facebook、苹果、微软、腾讯在半年内面试中常考）
    参考链接:
    养成收藏精选代码的习惯（示例）
    参考链接:
    二叉搜索树 Demo
    参考链接:
    树的遍历 Demo
    实战题目 / 课后作业:
    二叉树的中序遍历（亚马逊、微软、字节跳动在半年内面试中考过）
    二叉树的前序遍历（谷歌、微软、字节跳动在半年内面试中考过）
    N 叉树的后序遍历（亚马逊在半年内面试中考过）
    N 叉树的前序遍历（亚马逊在半年内面试中考过）
    N 叉树的层序遍历
    参考链接:
    维基百科：堆（Heap）
    堆的实现代码： https://shimo.im/docs/Lw86vJzOGOMpWZz2/
    实战例题:
    最小的 k 个数（字节跳动在半年内面试中考过）
    滑动窗口最大值（亚马逊在半年内面试中常考）
    课后作业:
    HeapSort ：自学 https://www.geeksforgeeks.org/heap-sort/
    丑数（字节跳动在半年内面试中考过）
    前 K 个高频元素（亚马逊在半年内面试中常考）
    本周作业
    简单：
    写一个关于 HashMap 的小总结。
    说明：对于不熟悉 Java 语言的同学，此项作业可选做。
    有效的字母异位词（亚马逊、Facebook、谷歌在半年内面试中考过）
    两数之和（近半年内，亚马逊考查此题达到 216 次、字节跳动 147 次、谷歌 104 次，Facebook、苹果、微软、腾讯也在近半年内面试常考）
    N 叉树的前序遍历（亚马逊在半年内面试中考过）
    HeapSort ：自学 https://www.geeksforgeeks.org/heap-sort/
    中等：
    字母异位词分组（亚马逊在半年内面试中常考）
    二叉树的中序遍历（亚马逊、字节跳动、微软在半年内面试中考过）
    二叉树的前序遍历（字节跳动、谷歌、腾讯在半年内面试中考过）
    N 叉树的层序遍历（亚马逊在半年内面试中考过）
    丑数（字节跳动在半年内面试中考过）
    前 K 个高频元素（亚马逊在半年内面试中常考）
    下周预习
    预习题目：
    爬楼梯
    括号生成
    Pow(x, n)
    子集
    N 皇后
    训练场练习（选做）:
    学有余力的同学，可以挑战以下【训练场】模拟面试真题：
    哈希相关：
    找雪花:
    树相关：
    安装路灯:
    二叉搜索树相关：
    二叉搜索树的后序遍历序列
    堆相关：
    最火视频榜单
    图相关：
    手游上线
*/